# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
scales: # there is no scaling for this model; the following scales are used only to bypass errors in model parsing
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, Timm, [352, 'efficientnet_b2', False, True, 0, True]]  # - 0
  - [0, 1, Index, [48, 2]]   # selects 2th output (1, 48, 80, 80) - 1
  - [0, 1, Index, [120, 3]]   # selects 3th output (1, 120, 40, 40) - 2
  - [0, 1, Index, [352, 4]]   # selects 4th output (1, 352, 20, 20) - 3
  - [-1, 1, SPPF, [176, 5]] # SPPF - 4
  - [-1, 2, C2PSA, [176]]   # C2PSA - 5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)
