# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
scales: # there is no scaling for this model; the following scales are used only to bypass errors in model parsing
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, Timm, [2048, 'resnext50_32x4d', True, True, 0, True]]  # ResNet-50 backbone with 1024 output channels
  - [0, 1, Index, [512, 2]]  # P3: (80x80, channels=512)
  - [0, 1, Index, [1024, 3]]  # P4: (40x40, channels=1024)
  - [0, 1, Index, [2048, 4]]  # P5: (20x20, channels=2048)
  - [-1, 1, SPPF, [1024, 5]]  # SPPF: half of 2048 (reduce channels)
  - [-1, 2, C2PSA, [1024]]  # C2PSA: same

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)
